//Здесь начинается и заканчивается выполнение программы.

#include <iostream>
#include "animal.h"
#include <string>
using namespace std;

int main()
{
    system("chcp 65001 > nul");
    Snake params(2, 50, 2);
    params.printInfo();
    
    while (true) {
        string input;
        cout << "Введите 'с днём рождения' для прибавления количества лет змее." << endl;
       getline(cin, input);
       if (input == "с днём рождения") {
           params.habbyBirthday();
           system("cls");
           params.printInfo();
       }
       else {
           break;
       };
        
    }
    return 0;
}

   /* animal m;

    char msg[] = ("Hello world!");
    m.PrintMessage(msg);
    return 0;*/
// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
